/*
Задача №13
Область видимости функций и переменных.
Написать контракт и подсчитать расход газа при работе с функциями и переменными,
с разной областью видимости и одной логикой работы.
Дать комментарии, какие области видимости в Solidity есть, а также комментарии,
содержащие выводы анализа затратности газа для работы с функциями и переменными с разной областью видимости
*/

/*
В solidity существуют 4 типа указателя области видимости для функций:
1. public
2. private
3. internal
4. external

и 3 указателя для переменных:
1. public
2. private
3. internal
*/